# 일단 소수의 특징이 잘 기억이 안나서 찾아보았다. 간략히 보면 본인외에 나누어 지는 수가 있으면 안된다.
# GPT의 도움과 블로그의 도움을 많이 받아 작성했다. 수학적, 프로그래밍적 지식 부족...
N = int(input())
data = list(map(int,input().split()))
count = 0

for x in data:   # x는 본인 수를 의미한다.
    for i in range(2, x+1):  # 2부터 본인 수까지 나눈다. range의 마지막수는 -1이므로 +1을 해야 본인 수까지 온다.
        if x % i == 0:    # 만약 해당 숫자가 나누었을때 몫이 0이되는 수
            if x == i:    # x와 i 같은 수 이 말은 즉슨 본인 외에 나누어 지는 값이 없을때 이므로 소수이다.
                count += 1  # 값을 1 올려준다.
            break
    
print(count)

# 소수의 특징은 본인 수 외에 나누어지는 수가 없다는 특징이 있다. 
# 그래서 2부터 시작해서 본인 수까지 모두 나눠서 0되고 그 나눠지는 수가 본인인지 확인해야하므로 if절이 두개이다.
# 모든 과정을 충족하면 count 값에 +1을 해주어 결과를 내보낸다.