# 일단 케스트 T를 받아서 range에다 입력한다. 이후 리스트에 첫번째값과 두번째값을 map을 통해 받는다.
# 두번째 값을 리스트로 나누어서 첫번째 값만큼 각각 반복시킨다.
T = int(input())

for _ in range(T):
    R = 0   # 전체 반복될 때마다 문자를 반복해야될 수를 초기화한다. 
 
    x = list(map(str,input().split()))  # 리스트를 str 값으로 먼저 받고 r값을 int로 변환하면 될 것 같다.
    for _ in x:
        R = int(x[0])   # 두번째 줄의 첫번째 요소를 뽑아옵니다. 반복횟수를 지정해 줍니다.
        S = list(str(x[1]))   # 추출한 두 번째 문자 값을 리스트 형식으로 쪼개서 넣는다.
    print(''.join([i * R for i in S]))  # 각 문자열 반복은 join을 통해 표현합니다. R은 반복횟수, S는 반복할 문자열입니다.



# 코드를 더 줄일 수 있는 방법을 GPT를 통해 알아보았다. 알고 보니 리스트로 나눠서 할 필요 없고 
# 입력값 그대로 나눠서 쓸 수 있었다. 
T = int(input())

for _ in range(T):     # T번만큼 반복한다.
    R, S = input().split()  # 인풋값을 리스트로 받을 필요없이 공백으로 두값을 받는다. 각각 함수는 R, S로한다.
    R = int(R)   # 반복횟수를 지정해 주는 R을 정수형으로 바꿔준다.(반복시키기위해)
    print(''.join([i * R for i in S]))  # 각 문자열 반복은 join을 통해 표현합니다. R은 반복횟수, S는 반복할 문자열입니다.
