# A는 낮에 올라가는 거리, B는 밤에 내려오는 거리, V는 도달해야되는 거리이다.
# 대강 생각해보면 A값에서 B값을 빼면 하루동안 간 거리인데, 이걸 낮에 올라간 거리부터 더해야한다.
# 왜냐하면, 낮에 이미 올라가 있으면 끝나기 때문이다.
# 최종적으로 더한 값이 V보다 크거나 같으면 끝난다.(if문을 써야하지 않을까...)
# GPT에 물어보니 마지막날 같은 경우 총 필요한 이동거리에 A를 미리 빼서 계산을 하면 더 효율적으로 계산 가능하다고 한다.
A, B, V = map(int, input().split())  # 각 입력값을 먼저 받는다.

LAST_DAY_remaining = V - A # 마지막 날을 제외한 거리(나중에 1일 더하면된다)
daily_move = A - B  # 하루동안 움직인 거리

# 잘 생각해보면 마지막 날을 제외한 남은 거리에 하루동안 움직일 수 있는 거리를 나눴을때
# 나머지가 0이면 그 날짜에서 +1만 해주면 되고 나머지가 생기면 한 날짜를 더 더한 후 마지막날 한 날을 더하면 된다.
# (거리가 부족하다는 것이니까)
if LAST_DAY_remaining % daily_move == 0:
     days = LAST_DAY_remaining // daily_move
else:
    days = (LAST_DAY_remaining // daily_move) + 1
    
print(days + 1)