# 일단 등차수열이 기억이 안나서 유튜브로 속성 강의를 듣고 있다. 등차수열은 연속 수의 차이가 일정한 수열이다.
# 수학교육과 동료분의 도움을 많이 받았다. 한수는 앞뒤 자리를 비교해서 일정한 간격이면 한수이다.
# 근데 숫자가 1개이거나 2개일때는 앞뒤로 비교할 수가 없기 때문에 모두 한 수가 된다
# 이제 3자리 수부터 앞뒤수가 일정한지 확인해야한다. 예를 들어 123이나 135는 한수이다.
# 공차가 0이어도 등차이므로 111도 한수이다.
def han_number(n):
    if n < 100:   # 100전까지는 모두 한수 이므로 True이다.
        return True
    if n == 1000:   # 1000은 한수가 아니므로 예외처리한다.
        return False
    a, b, c = map(int,str(n))  # 1000보다 작거나 같은 자연수 N이므로 3자리 숫자만 비교하면된다.
    return (a-b) == (b-c)   # 실제로 각 자리를 추출해서 빼서 비교한다. 

n = int(input())
count = sum(han_number(i) for i in range(1, n+1))  
# 입력된 수까지 함수에 넣어서 True값 반환(한수 갯수를 센다)
# 해당부분이 생각하기 쉽지 않은것 같다. 함수와 함께 for문을 써도 되는지 몰랐다.
print(count)

# 한수라는 개념을 잡는데에도 30분은 걸린 것 같다. 
# 또한 이걸 반복문과 함께 써서 True값을 추출할 생각하는게 쉽지 않은 것 같다.