# 어떤 11보다 작은 정수를 1,2,3의 합으로만 나오는 경우의 수를 구하는 것이다.
# 이 문제는 점화식을 통해 해결한다.
# 대략 정수 5까지 적어보면 전에 나온값을 합치면 나온다는 것을 알 수 있다.
T = int(input())

arr = [0]*11        # n은 양수이고 11보다 작으므로 해당부분만 리스트로 만든다.(공간만들기)
arr[1] = 1    # n=1이면 1이다.
arr[2] = 2    # n=2이면 2이다.
arr[3] = 4    # n=3이면 4이다.

# 방법의 수를 구해내는 핵심 코드이다.
for i in range(4,11):    # 4부터 11까지는 해당 과정을 사용한다.
    arr[i] = arr[i-1] + arr[i-2] + arr[i-3]   # n=(n-1)+(n-2)+(n-3)이며 점화식에 해당한다.
    # 예를 들어 5의 경우는 4과 3,2의 결과값의 합과 같다.
    
# T만큼 정수 n을 입력 받는다.
for _ in range(T):
    test_num = int(input())
    print(arr[test_num])    # 입력된 정수 n에 대해 계산한 결과를 출력한다.