# 해당 문제를 풀기 위해서는 지워져야하는 숫자보다 이상의 값들중 제일 큰수가 앞에 나오기만 하면된다.
# 그럼 스택으로 넣어서 계산해서 제일 큰 수 나오게 하면될 것 같은데...
# GPT에 물어보니 앞에서부터 숫자를 확인하면서 앞에 숫자가 현재 숫자보다 크면 이전 숫자를 제거한다고 한다.
# 제거를 하다가 K == 0(즉, 지워야하는 K가 없으면) 지우는 과정을 중단하고 출력한다.
# 그러나 K만큼 지우지 못했다면, 지우지 못한 K만큼 뒤에서 지우면 된다.

import sys

N, K = map(int, sys.stdin.readline().strip().split())
number = sys.stdin.readline().strip()  # 문자열 형태로 입력 받음

stack =[]  # 스택 넣을 공간

# 모든 숫자를 반복해서 넣어봅니다
for i in number:
    while K > 0 and stack and stack[-1] < i:  
    # K는 0보다 크고(K가 0일 때 삭제하면 안되므로), 스택이 비어있으면 종료(스택 비었는데 돌아가면 오류난다)(범위)
    # stack[-1] < i은 앞전값과 비교하여 현재값이 크면 앞의 현재값보다 작은 수를 모두 삭제한다.(조건)
        stack.pop()   # 작은수를 뺀다
        K -= 1   # 뺏으니 지워야하는 K에서 1을 뺀다
        
    stack.append(i)    # 그리고 다 돌아간 수는 스택에 추가한다.
    
answer = ''.join(stack[:len(stack) - K])
# answer를 stack에 K 남은 만큼 빼서 넣습니다
# 마지막 확인과 같습니다

print(answer)

# 이론은 이해하기 어렵지 않은데, 막상 코드를 구현하려니 쉽지 않았습니다.
# 특히 while문의 조건이 왜 저렇게 긴지, 최종답확인전에 K만큼 빼졌는지 확인하고 지우는 과정이
# 구현하기 어렵다고 생각됩니다. 익숙해지도록 노력하겠습니다.